Revit 2027 API
AnnotationLabelParameterFormatting.IsValidObject Property
 Specifies whether the .NET object represents a valid Revit entity.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidObject { get; }
Public ReadOnly Property IsValidObject As Boolean
	Get
public:
property bool IsValidObject {
	bool get ();
}
member IsValidObject : bool with get
Return Value
Boolean
 True if the API object holds a valid Revit native object, false otherwise.
Remarks
 If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
See Also
Reference
AnnotationLabelParameterFormatting Class
Autodesk.Revit.DB Namespace